<a href="https://colab.research.google.com/github/Geeta1999/PythonNotes/blob/main/pandas_intermediate.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
list_1 = [1, 2, 3, 4, 5, 6, 7, 8]

In [ ]:
type(list_1)

list

In [ ]:
series_1 = pd.Series(list_1)

In [ ]:
series_1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [ ]:
type(series_1)

pandas.core.series.Series

In [ ]:
series_2 = pd.Series(list_1, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [ ]:
print(series_2)

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [ ]:
dict_1 = {
    'a': 1,
    'b': 2,
    'c': 3,
    'd': 4,
    'e': 5
}

In [ ]:
series_3 = pd.Series(dict_1)

In [ ]:
series_3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
series_1.shape

(8,)

In [ ]:
series_1.dtype

dtype('int64')

In [ ]:
series_1.index

RangeIndex(start=0, stop=8, step=1)

In [ ]:
series_1.to_list()

[1, 2, 3, 4, 5, 6, 7, 8]

In [ ]:
series_1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [ ]:
series_1[0:8:2]

0    1
2    3
4    5
6    7
dtype: int64

In [ ]:
series_2

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [ ]:
series_2[0:7:2]

a    1
c    3
e    5
g    7
dtype: int64

In [ ]:
series_1[-4::2]

4    5
6    7
dtype: int64

In [ ]:
series_2.loc['a']

1

In [ ]:
series_2.loc['a':'e']

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
series_2.iloc[0:7]

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [ ]:
data_frame = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

In [ ]:
data_frame

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
data_frame = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                          columns=['A', 'B', 'C'], index=['a', 'b','c'])

In [ ]:
data_frame

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [ ]:
dict_2 = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}

In [ ]:
data_frame = pd.DataFrame(dict_2)

In [ ]:
data_frame

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [ ]:
data_frame = pd.read_csv('./insurance.csv')

In [ ]:
data_frame

      age     sex   bmi  children smoker     region  expenses
0      19  female  27.9         0    yes  southwest  16884.92
1      18    male  33.8         1     no  southeast   1725.55
2      28    male  33.0         3     no  southeast   4449.46
3      33    male  22.7         0     no  northwest  21984.47
4      32    male  28.9         0     no  northwest   3866.86
...   ...     ...   ...       ...    ...        ...       ...
1333   50    male  31.0         3     no  northwest  10600.55
1334   18  female  31.9         0     no  northeast   2205.98
1335   18  female  36.9         0     no  southeast   1629.83
1336   21  female  25.8         0     no  southwest   2007.95
1337   61  female  29.1         0    yes  northwest  29141.36

[1338 rows x 7 columns]

In [ ]:
data_frame.shape

(1338, 7)

In [ ]:
data_frame.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
expenses    float64
dtype: object

In [ ]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   expenses  1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [ ]:
data_frame.iloc[0:5, :]

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

In [ ]:
data_frame.iloc[:5, :3]

   age     sex   bmi
0   19  female  27.9
1   18    male  33.8
2   28    male  33.0
3   33    male  22.7
4   32    male  28.9

In [ ]:
data_frame.loc[:10, 'age':'smoker']

    age     sex   bmi  children smoker
0    19  female  27.9         0    yes
1    18    male  33.8         1     no
2    28    male  33.0         3     no
3    33    male  22.7         0     no
4    32    male  28.9         0     no
5    31  female  25.7         0     no
6    46  female  33.4         1     no
7    37  female  27.7         3     no
8    37    male  29.8         2     no
9    60  female  25.8         0     no
10   25    male  26.2         0     no

In [ ]:
data_frame.index

RangeIndex(start=0, stop=1338, step=1)

In [ ]:
data_frame.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'expenses'], dtype='object')

In [ ]:
data_frame[['age', 'sex', 'bmi']][0:10]

   age     sex   bmi
0   19  female  27.9
1   18    male  33.8
2   28    male  33.0
3   33    male  22.7
4   32    male  28.9
5   31  female  25.7
6   46  female  33.4
7   37  female  27.7
8   37    male  29.8
9   60  female  25.8

In [ ]:
import pandas as pd

In [ ]:
data_frame = pd.read_csv('./insurance.csv')

In [ ]:
data_frame.head()

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

In [ ]:
(data_frame['children'] + 1)

0       1
1       2
2       4
3       1
4       1
       ..
1333    4
1334    1
1335    1
1336    1
1337    1
Name: children, Length: 1338, dtype: int64

In [ ]:
data_frame['family_count'] = data_frame['children'] + 1

In [ ]:
data_frame.head()

   age     sex   bmi  children smoker     region  expenses  family_count
0   19  female  27.9         0    yes  southwest  16884.92             1
1   18    male  33.8         1     no  southeast   1725.55             2
2   28    male  33.0         3     no  southeast   4449.46             4
3   33    male  22.7         0     no  northwest  21984.47             1
4   32    male  28.9         0     no  northwest   3866.86             1

In [ ]:
data_frame['avg_exp_per_head'] = data_frame['expenses'] / data_frame[
    'family_count']

In [ ]:
data_frame.head()

,age,sex,bmi,children,smoker,region,expenses,family_count,avg_exp_per_head
0,19,female,27.9,0,yes,southwest,16884.92,1,16884.920
1,18,male,33.8,1,no,southeast,1725.55,2,862.775
2,28,male,33.0,3,no,southeast,4449.46,4,1112.365
3,33,male,22.7,0,no,northwest,21984.47,1,21984.470
4,32,male,28.9,0,no,northwest,3866.86,1,3866.860

In [ ]:
data_frame_2 = data_frame.drop('children', axis=1)

In [ ]:
data_frame_2.drop('bmi', axis=1, inplace=True)

In [ ]:
data_frame_2.head()

   age     sex smoker     region  expenses  family_count  avg_exp_per_head
0   19  female    yes  southwest  16884.92             1         16884.920
1   18    male     no  southeast   1725.55             2           862.775
2   28    male     no  southeast   4449.46             4          1112.365
3   33    male     no  northwest  21984.47             1         21984.470
4   32    male     no  northwest   3866.86             1          3866.860

In [ ]:
data_frame.sort_values(by=['age', 'bmi'], ascending=[True, False], inplace=True)

In [ ]:
data_frame.sort_index(inplace=True)

In [ ]:
data_frame.head()

,age,sex,bmi,children,smoker,region,expenses,family_count,avg_exp_per_head
0,19,female,27.9,0,yes,southwest,16884.92,1,16884.920
1,18,male,33.8,1,no,southeast,1725.55,2,862.775
2,28,male,33.0,3,no,southeast,4449.46,4,1112.365
3,33,male,22.7,0,no,northwest,21984.47,1,21984.470
4,32,male,28.9,0,no,northwest,3866.86,1,3866.860

In [ ]:
data_frame['age'].min(), data_frame['age'].max()

(18, 64)

In [ ]:
grouped_df = data_frame.groupby('age')

In [ ]:
type(grouped_df)

pandas.core.groupby.generic.DataFrameGroupBy

In [ ]:
type(data_frame)

pandas.core.frame.DataFrame

In [ ]:
age_analysis_df = grouped_df['avg_exp_per_head'].agg(['mean', 'count', 'std'])

In [ ]:
age_analysis_df.head()

            mean  count           std
age
18   5844.538594     69   9520.074546
19   8318.573725     68  11855.634963
20   6715.886092     29   8516.566620
21   2721.650696     28   3251.111162
22   6206.272262     28   9623.579993

In [ ]:
grouped_df[['avg_exp_per_head', 'bmi']].agg(['mean', 'count', 'std']).head()

    avg_exp_per_head                            bmi
                mean count           std       mean count       std
age
18       5844.538594    69   9520.074546  31.333333    69  6.965011
19       8318.573725    68  11855.634963  28.598529    68  5.860887
20       6715.886092    29   8516.566620  30.627586    29  4.634259
21       2721.650696    28   3251.111162  28.189286    28  6.335400
22       6206.272262    28   9623.579993  31.092857    28  6.964616

In [ ]:
data_frame.head()

,age,sex,bmi,children,smoker,region,expenses,family_count,avg_exp_per_head
0,19,female,27.9,0,yes,southwest,16884.92,1,16884.920
1,18,male,33.8,1,no,southeast,1725.55,2,862.775
2,28,male,33.0,3,no,southeast,4449.46,4,1112.365
3,33,male,22.7,0,no,northwest,21984.47,1,21984.470
4,32,male,28.9,0,no,northwest,3866.86,1,3866.860

In [ ]:
def compute_age_group(age):
    if age <= 23:
        return 'Student'
    elif (age > 23) and (age < 50):
        return 'Adult'
    else:
        return 'Aged'

In [ ]:
data_frame['category'] = data_frame['age'].apply(compute_age_group)

In [ ]:
data_frame.head()

,age,sex,bmi,children,smoker,region,expenses,family_count,avg_exp_per_head,category
0,19,female,27.9,0,yes,southwest,16884.92,1,16884.920,Student
1,18,male,33.8,1,no,southeast,1725.55,2,862.775,Student
2,28,male,33.0,3,no,southeast,4449.46,4,1112.365,Adult
3,33,male,22.7,0,no,northwest,21984.47,1,21984.470,Adult
4,32,male,28.9,0,no,northwest,3866.86,1,3866.860,Adult

In [ ]:
data_frame['category'].value_counts()

Adult      703
Aged       385
Student    250
Name: category, dtype: int64

In [ ]:
data_frame.drop_duplicates(inplace=True)

In [ ]:
df_bool = data_frame.isnull()

In [ ]:
df_bool.sum(axis=0)

age                 0
sex                 0
bmi                 0
children            0
smoker              0
region              0
expenses            0
family_count        0
avg_exp_per_head    0
category            0
dtype: int64

In [ ]:
series_bool = data_frame['age'] == 19

In [ ]:
df_19 = data_frame.loc[series_bool, :]

In [ ]:
df_19.shape

(67, 10)